<a href="https://colab.research.google.com/github/VishwasSaini32/US-Retail/blob/master/US_Retail.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import numpy as np

In [0]:
df = pd.read_excel("mrtssales92-present.xls",sheet_name = None, skiprows= 3, header = 1)

In [183]:
type(df)

dict

In [184]:
df['1992']

    NAICS  Code  ...    TOTAL
0           NaN  ...      NaN
1           NaN  ...  2014102
2           NaN  ...  1595709
3           NaN  ...  1857778
4           NaN  ...  1439385
..          ...  ...      ...
100         453  ...      NaN
101         454  ...      NaN
102        4541  ...      NaN
103       45431  ...      NaN
104         722  ...      NaN

[105 rows x 15 columns]

#Extracting Main Categories

Since Data

In [0]:
for key in df:
    df_cat[key] = df[key]
    df_cat[key]['NAICS  Code'] = df_cat[key]['NAICS  Code'].astype('str')
    df_cat[key]['NAICS Code Cat'] = df_cat[key]['NAICS  Code'].str.extract('^(\d{3})$')

In [186]:
df_cat['2020'][['NAICS  Code', 'NAICS Code Cat']]

    NAICS  Code NAICS Code Cat
0           nan            NaN
1           nan            NaN
2           nan            NaN
3           nan            NaN
4           nan            NaN
..          ...            ...
101         454            454
102        4541            NaN
103       45431            NaN
104         722            722
105                        NaN

[106 rows x 2 columns]